### DataFrame

- 표같은 스프레드시크 형식의 자료구조
- 여러 개의 컬럼이 있는데 각 컬럼은 다른 종류의 값(숫자, 문자열, 불리언 등)을 담을 수 있음
- low와 column에 대한 index 가지는 데, index모양이 같은 Series객체를 담고있는 파이썬 사전으로 생각하면 됨
- 데이터는 리스트나 사전 또는 1차원 배열을 담고있는 다른 컬렉션이 아니라 하나 이상의 2차원 배열에 저장
- 물리적으로 2차원이나 계층적 색인 이용하여 좀더 고차원 데이터 표현 가능함
- 내부 데이터에 대한 뷰로 복사가 이뤄지지 않음.DataFrame에서의  변경은 실제 데이터도 변경시킴
    - 필요시`Series의 copy`메서드 사용!!

In [1]:
data = {'state' : ['ohio', 'ohio', 'ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year' : [2000, 2001,2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

- 위에서 5개 출력

In [2]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

- 칼럼 순서 지정

In [3]:
pd.DataFrame(data, columns=['year', 'state'])

   year   state
0  2000    ohio
1  2001    ohio
2  2002    ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

- 없는 값을 넘기면 결측치로 저장 & index 변경

In [4]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two','three', 'four','five','six'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

- DataFrame의 column - 사전형식 표기법 또는 속성 형식으로 접근

In [5]:
frame2['state']  # 어떤 칼럼이든 사용 가능

one        ohio
two        ohio
three      ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [6]:
frame2.year # 파이썬에서 사용가능한 변수 이름 형식일때만 가능

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

- 반환되는 Series객체가 DataFrame과 같은 색인 가지면 알맞은 값으로 name 속성 채워짐
- `low`는 `위치`나 `loc` 속성 이용해 이름통해 접근 가능함

In [7]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

- 칼럼 값 채우기

In [8]:
frame2['debt'] = 1.5
frame2

       year   state  pop  debt
one    2000    ohio  1.5   1.5
two    2001    ohio  1.7   1.5
three  2002    ohio  3.6   1.5
four   2001  Nevada  2.4   1.5
five   2002  Nevada  2.9   1.5
six    2003  Nevada  3.2   1.5

In [9]:
frame2['debt']= np.arange(6.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [10]:
# list나 array에 column대입시 , 대입하려는 값의 길이가 DataFrame의 길이와 동일해야 함
# Series를 대입하면 DataFrame의 색인에 따라 값이 대입되며 존재하지 않는 색인에는 결측치 대입

val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

- 새로운 칼럼 생성 : 존재하지 않는 칼럼을 대입할 경우
- `del` : 칼럼 삭제

In [11]:
frame2['eastern'] = frame2.state == 'ohio'
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [12]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [13]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

- 중첩된 사전으로 데이터 생성 : 바깥에 있는 사전의 키는 칼럼이 되고, 안에 있는 키는 로우가 됨

In [14]:
pop = {'Nevada' : {2001:2.4, 2002 : 2.9},
      'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [15]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [16]:
# 전치
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [17]:
# 색인 직접 지정 : 지정된 색인으로 DataFrame 생성

pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [18]:
# 사전 데이터의 DataFrame생성

pdata = {'Ohio' : frame3['Ohio'][:-1],
                  'Nevada': frame3['Nevada'][:3]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   NaN     2.9

- DataFrame 생성을 위한 입력 데이터 종류

|형|설명|
|:--|:--|
|2차원 ndarray|데이터를  담고있는 행렬. 선택적으로 행(로우)과 열(칼럼)의 이름을 전달할 수 있음|
|배열, 리스트, 튜플의 사전|사전의 모든 항목은 같은 길이를 가져야 하며, 각 항목의 내용이 DataFrame의 칼럼이 됨|
|Numpy의 구조화 배열|배열의 사전과 같은 방식으로 취급됨|
|Series의 사전|Series의 각 값이 칼럼이 됨. 명시적으로 색인을 넘겨주지 않으면 각 Series의 색인이 하나로 합쳐져서 로우의 색인이 됨|
|사전의 사전|내부에 있는 사전이 칼럼이 됨. 키값은 'Series의 사전'과 마찬가지로 함쳐져서 로우의 색인이 됨|
|사전이나 Series의 리스트|리스트의 각 항목이 DataFrame의 로우가 됨. 합쳐진 사전의 키값이나 Series의 색인이 DataFrame의 칼럼 이름이 됨|
|리스트나 튜플의 리스트|'2차원 ndarray'의 경우와 같은 방식으로 취급됨|
|다른 DataFrame|색인을 따로 지정하지 않으면 DataFrame의 색인이 그대로 사용됨|
|NumPy MaskedArray|'2차원 ndarray'의 경우와 같은 방식으로 취급되지만 마스크값은 반환되는 DataFrame에서 NA값이 됨|

- DataFrame의 index와 colums에 name 속성 지정

In [19]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

- values 속성 : DataFrame에 저장된 데이터를 2차원 배열로 반환

In [20]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [21]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

참고 자료
> Python for Data Analysis(2019), 한빛미디어